/* 
Операція ... (rest) дозволяє зібрати групу незалежних елементів у нову колекцію. Синтаксично - це близнюк операції розподілу, але відрізнити їх просто - розподіл - коли ... знаходиться у правій частині операції присвоювання, а збирання - коли ... знаходиться в її лівій частині.
*/

/* function func(x, y, ...myProps) {
  // x = 10
  // y = 20
  // ...args = 30,40
  console.log(arguments);
  console.log(myProps);
} */

// func(10, 20, 30, 40, 30, 40, 60, 10);

/* 
Збирання остаточних параметрів
*/

// const arr = [10, 20, 30, 40, 50, 60, 70];

// function foo(myArray, ...array2) {
//   const result = [];
//   for (let el of myArray) {
//     if (array2.includes(el)) {
//       result.push(el);
//     }
//   }
//   //   console.log(result);
// }

// foo(arr, 10, 50, 60, 1, 2, 5, 6);
