/*

 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає новий масив.
 - Додає у масив, що повертається, елементи, які задовольняють умови колбек-функції.
 - Якщо колбек повернув true, елемент додається у масив, що повертається.
 - Якщо колбек повернув false, елемент не додається у масив, що повертається.
 - Якщо жоден елемент не задовольнив умову, повертає порожній масив.

*/

let array = [0, 5, 1, 2, 4, 1, 3, 7, 7, 85, 2, 58, 12];

const result = array.filter((el, idx, arr) => {
  return el > 10 || el < 5;
});

console.log(result);
